Aero/openFoam/Airfoil/2DAirfoil/alpha0/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0.0386;

boundaryField
{
    inlet
    {
        type            freestream;
        freestreamValue uniform 0.0386;
    }

    outlet
    {
        type            freestream;
        freestreamValue uniform 0.0386;
    }

    airfoil
    {
        type            nutUSpaldingWallFunction;
        value           uniform 0;
    }

    frontAndBack
    {
        type            empty;
    }
 
    topAndBottom
    {
        type            symmetryPlane;
    }
}

// ************************************************************************* //
