Aero/openFoam/Airfoil/2DAirfoil/alpha0/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver           GAMG;
        tolerance        1e-06;
        relTol           0.1;
        smoother         GaussSeidel;
        nPreSweeps       0;
        nPostSweeps      2;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 10;
        agglomerator     faceAreaPair;
        mergeLevels      1;
    }

    U
    {
        solver           smoothSolver;
        smoother         GaussSeidel;
        nSweeps          2;
        tolerance        1e-08;
        relTol           0.1;
    }

    nuTilda
    {
       solver            smoothSolver;
       smoother          GaussSeidel;
       nSweeps           2;
       tolerance         1e-08;
       relTol            0.1;
    }
}

SIMPLE
{
      nCorrectors              1;
      nNonOrthogonalCorrectors 2;
      pRefCell                 0;
      pRefValue                0;
      residualControl
    {
      p                        1e-5;
      U                        1e-5;
      nuTilda                  1e-5;
    }
}
     relaxationFactors
    {

     fields
    {
      p                        0.3;
    }
     equations
    {
      U                        0.7;
      nuTilda                  0.7;
    }
}

// ************************************************************************* //
